{ 
	"AboutMe": {
		"name": "Caro CodingK",
		"occupation": "Software Engineer",
		"image": "/profilePic.jpg",
		"description": [
			"Hello, World!",
			"I'm Caro, a motivated Software Engineer with a degree in Computer Science and Electronics Engineering. I absolutely love tech and enjoy building fun stuff on the web. I've spent a lot of time working on personal projects, mostly web apps using React.js, and I enjoy bringing creative ideas to life through code.",
			"Beyond web development, I've dabbled in some pretty cool projects involving natural language processing, computer vision, and robotics. I have experience in Python, JavaScript, and C++, and I’m always excited to dive into new tools and technologies.",
			"I really enjoy solving problems, learning by doing, and teaming up with others to create things that make a difference. Let’s connect and chat!"
		]
	},
	"Projects": [
		{
			"title": "Pomodoro Timer and To Do List ",
			"image": "/profilePic.jpg",
			"description": [
				"Web application designed to enhance productivity by combining a to-do list with a built-in Pomodoro timer. It helps users organize their tasks and work in focused intervals, following the Pomodoro technique."
			],
			"description_list": [
				"Users can plan their day with an intuitive task list that supports adding, editing, and removing one or tasks.",
				"The Pomodoro timer allows user to work in 25 minutes focus sessions followed by 5 minutes breaks."
			],
			"url1": "https://github.com/carocodingk/PomodoroTracker",
			"url2": "https://nextjs.org/docs/app/getting-started/images-and-fonts",
			"technology": ["React", "Next.js"]
		},
		{
			"title": "Tic - Tac - Toe",
			"image": "/profilePic.jpg",
			"description": [
				"Web-based tic tac toe game features a clean, responsive interface for two players to compete locally."
			],
			"description_list": [],
			"url1": "https://github.com/carocodingk/PomodoroTracker",
			"url2": "https://nextjs.org/docs/app/getting-started/images-and-fonts",
			"technology": ["React", "Next.js"]
		},
		{
			"title": "Pet Store Web Application",
			"image": "/profilePic.jpg",
			"description": [
				"E-commerce platform tailored for a pet store, built to deliver a smooth and scalable user experience. It includes core functionalities such as:"
			],
			"description_list": [
				"Product Catalog: A dynamic filterable listing of pet products, organized by category (e.g., cats, dogs, birds, fish). Products support images and pricing",
				"Shopping Cart: it handles item quantities, pricing, and checkout preparation. ",
				"Blog Articles Section: it features where admins can publish educational content. "
			],
			"url1": "https://github.com/carocodingk/web-application-retail-pet-store-react",
			"url2": "https://carocodingk.github.io/web-application-retail-pet-store-react",
			"technology": ["React"]
		},
		{
			"title": "Personal Portfolio",
			"image": "/profilePic.jpg",
			"description": [
				"Lightweight, single-page resume website designed to present an individual's professional profile in a clean, modern, and accessible format."
			],
			"description_list": [],
			"url1": "https://github.com/carocodingk/PomodoroTracker",
			"url2": "https://nextjs.org/docs/app/getting-started/images-and-fonts",
			"technology": ["JavaScript", "HTML", "CSS"]
		},
		{
			"title": "Personal Resume",
			"image": "/profilePic.jpg",
			"description": [
				"Simple yet elegant portfolio webpage designed to present personal or professional work in a visually appealing and accessible format. Built with a focus on responsiveness and performance, it provides a lightweight and polished platform to highlight projects, skills, and contact information."
			],
			"description_list": [],
			"url1": "https://github.com/carocodingk/PomodoroTracker",
			"url2": "https://nextjs.org/docs/app/getting-started/images-and-fonts", 
			"technology": ["JavaScript", "HTML", "CSS"]
		}
	]

}